# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1 = pd.read_csv("cars1.csv")
cars2 = pd.read_csv("cars2.csv")

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [3]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [4]:
cars1 = cars1.loc[:,"mpg":"car"]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [5]:
cars1.shape[0]

198

In [6]:
cars2.shape[0]

200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [7]:
cars = pd.concat([cars1, cars2])
cars.shape

(398, 9)

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [8]:
import numpy as np
owners = np.random.randint(low = 15000, high = 73001, size = 398, dtype = "l")

In [9]:
owners

array([52459, 43221, 55215, 66396, 27041, 31824, 16631, 53393, 66904,
       58323, 48940, 39056, 67481, 17753, 39967, 21208, 43094, 54631,
       38327, 19317, 59540, 27629, 70766, 71934, 47933, 19085, 28095,
       35839, 34835, 26434, 34930, 63977, 45090, 61449, 29914, 34028,
       68403, 26200, 36568, 19546, 40837, 46596, 61938, 36990, 19742,
       33830, 30063, 18027, 18903, 35634, 65718, 41724, 18910, 19139,
       31691, 53922, 64338, 43194, 21755, 44952, 46338, 62543, 45909,
       67735, 71224, 31850, 43943, 43813, 68917, 63729, 22919, 72243,
       65538, 67952, 59342, 56459, 54654, 43464, 69508, 55011, 48923,
       29038, 20900, 36996, 66162, 45491, 45723, 68318, 18590, 32597,
       32323, 61877, 44348, 17639, 57024, 43967, 57237, 64212, 44285,
       34718, 65998, 46288, 57317, 19798, 69116, 69601, 28176, 72271,
       61512, 21739, 30841, 42467, 49372, 70772, 44252, 28126, 21648,
       38930, 55664, 20478, 63478, 27921, 56951, 38532, 32388, 28779,
       56910, 70765, 72206, 51082, 48772, 39324, 43290, 43995, 53473,
       64562, 27115, 62262, 30307, 27446, 54956, 40403, 25907, 56624,
       35196, 19163, 55025, 48186, 61363, 25996, 21470, 48420, 51478,
       18904, 26207, 38549, 16440, 34127, 53320, 19356, 68884, 30132,
       43349, 28913, 30650, 63004, 53596, 60226, 71200, 22246, 65441,
       59599, 27929, 52060, 40056, 31766, 70131, 17634, 71544, 35890,
       42584, 38520, 53298, 59805, 34784, 65887, 63246, 68046, 62411,
       17796, 62175, 48718, 51959, 27397, 62822, 46607, 64233, 53950,
       31377, 19798, 61218, 15554, 66437, 56386, 53567, 22845, 15023,
       50802, 36938, 37538, 49531, 39337, 65237, 71000, 25320, 72883,
       45359, 66542, 58703, 30718, 53575, 22096, 62704, 20501, 34570,
       53204, 23734, 29370, 64899, 29608, 62791, 49389, 58523, 24916,
       42401, 55130, 45062, 42076, 68918, 46512, 42705, 33214, 71087,
       18744, 68099, 42938, 64800, 40552, 41355, 66177, 23125, 49398,
       31341, 30767, 22070, 24317, 54000, 44837, 28187, 49975, 29475,
       69026, 42525, 53260, 47627, 26414, 27383, 57570, 59129, 47851,
       47955, 23647, 46315, 71164, 68078, 61907, 30641, 35887, 56549,
       66507, 42512, 47043, 47376, 30900, 70229, 26329, 17826, 50917,
       40841, 61089, 33628, 41921, 49476, 67664, 17942, 34844, 41074,
       20181, 17700, 56349, 45171, 54689, 69043, 20778, 51439, 33074,
       66200, 21819, 52403, 16248, 48857, 55396, 36841, 18878, 69826,
       59681, 30007, 39347, 48063, 50179, 55856, 58126, 61892, 30921,
       40633, 48220, 35400, 21456, 68988, 30298, 41910, 43455, 38601,
       16995, 43737, 69141, 34187, 20365, 28069, 28550, 46077, 60472,
       44607, 21382, 34996, 66124, 56328, 34966, 66975, 36026, 41897,
       18727, 67088, 29654, 40243, 22086, 20118, 70409, 41220, 67015,
       40159, 50219, 49824, 68116, 68128, 19810, 36777, 55498, 32195,
       37670, 68249, 24318, 64188, 19806, 56886, 37802, 52835, 37808,
       18726, 31048, 67121, 60010, 34364, 39377, 54000, 37656, 47282,
       48091, 44249, 37879, 46841, 68121, 56030, 19174, 46231, 69305,
       69670, 60414])

### Step 8. Add the column owners to cars

In [10]:
cars["owners"] = owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,52459
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,43221
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,55215
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,66396
4,17.0,8,302,140,3449,10.5,70,1,ford torino,27041